{"sections":{"main":{"type":"main-faq","blocks":{"faqs-0":{"type":"faq","settings":{"title":"Can I buy products individually?","content":"<p>Yes, you can purchase our products individually. Click here to explore our complete range of men's grooming products.<\/p>"}},"faqs-1":{"type":"faq","settings":{"title":"Can I return the products?","content":"<p>Cancellations: Orders once placed can be cancelled on the same day by reaching out to our customer care. If you cancel it in time, will refund the full amount back into your account. If your order does not require custom engraving, then orders can be cancelled until they are packed which is typically by 2 pm on the next business day.Refunds: Starting Dec 1, 2016, we offer a 30 day money-back guarantee on the purchase of the 6-Part Shaving System. All buyers\/gift buyers of the 6-Part Shaving System can return the products to us after 30 days of usage, if you\/the person you gifted to are not happy with the results. We will refund the full amount minus shipping (INR 300) and admin charges (an additional INR 300). This money back guarantee is not offered on any other product or products purchased individually.On individual purchases or, on purchase of the 3-Step Regimen\/Precision Safety Razor, we only provide refunds for damages and other genuine cases. Once the products are used, we cannot offer a refund as the products cannot be resold to customers.While we take a lot of effort to ensure that every customer’s expectation is fulfilled, we understand that sometimes, we make mistakes and cannot match up to your expectations. So if there are still any concerns, do reach out to us and we will see what can be done. Please contact our customer care (Ph: 011-3958 8025\/ Email: care@bombayshavingcompany.com) regarding cancellation or refunds.<\/p>"}},"faqs-2":{"type":"faq","settings":{"title":"Can I buy the kit without setting up subscription?","content":"<p>Yes, you can. Come back and subscribe once you've used the products and know which ones you'd actually like.<\/p>"}},"faqs-3":{"type":"faq","settings":{"title":"Why are your products more expensive compared to other shaving products in the market?","content":"<p>We believe in delivering premium quality grooming products to our customers like our razor which is an extremely precise engineered machine. Hence, the higher price. Our formulations, on the other hand, are comparable to other best in class products. Our soaps are handmade with the best ingredients and are 100% natural. Over the long term, we believe our grooming regimen is much higher value for money when compared to any other brand.<\/p>"}},"7e1b959c-296e-432b-8fd1-7b5ad6895a70":{"type":"faq","settings":{"title":"If I plan to gift the kit to someone, how do I do it?","content":"<p>Thanks for choosing our products for your gifting needs. We suggest you add your mobile number and email address when gifting so that the order notifications get sent to you and not the giftee. The shipping address on the other hand, can be filled in based on whether you want the kit shipped to you or directly to the giftee.<\/p>"}},"288d1082-3daf-46f9-bd3f-4ad2e323d6fb":{"type":"faq","settings":{"title":"Why did I not receive credits on an order placed by my friends?","content":"<p>Credits are only given on successful completion and delivery of the order.<\/p>"}},"1a3d4015-e3a6-47bb-b7b2-29eedb5df2b7":{"type":"faq","settings":{"title":"Do you provide gift wrapping services?","content":"<p>No we do not as our products are currently shipped through third-party courier companies. However, the packaging used for our shaving kits and soap bundles were designed keeping gifting in mind and therefore do not require additional wrapping.<\/p>"}},"e577bb80-7def-4804-ab60-2a9d53ecf1a4":{"type":"faq","settings":{"title":"Do you provide Cash On Delivery (COD)?","content":"<p>No we do not currently provide COD. However, we are figuring out a way to launch it in the future. We currently provide payment options for credit, debit and other popular portals. All our payment gateways are 128-bit SSL encrypted.<\/p>"}},"39fca6f8-546b-4452-83a9-84297981c949":{"type":"faq","settings":{"title":"How do I place an order if I reside outside India?","content":"<p>If you reside in the US, you can purchase our products on Amazon (https:\/\/www.amazon.com\/). If you reside in other parts of the world, besides India and the US, you can write to us at care@bombayshavingcompany.com and we will process your order offline.<\/p>"}},"d9f62ee5-effa-4ed4-925f-6ba7c1ba1eb9":{"type":"faq","settings":{"title":"How does subscription work?","content":"<p>Once you have logged in to your account on our website you can set up a subscription plan. The plan currently only pertains to our shaving range of products but we will add other products to it in the future. After you buy the 6-Part Shaving System, you can subscribe to the 4 shaving supplies we will refill - Feather blades, Pre-Shave Scrub, Shaving Cream and Post-Shave Balm. Each of these products will last 70-80 shaves. Once you tell us how often you shave, we will estimate the depletion rate of these products and automatically replenish them for you.<\/p>"}},"30a12927-e3c0-4285-8b07-36b6c1e6d04c":{"type":"faq","settings":{"title":"Is the subscription flexible?","content":"<p>Absolutely. You can choose which products you want and at what frequency you want them replenished. You can pause and restart the subscription any time as well as shift the date of your next replenishment. You can also cancel the subscription at any time.<\/p>"}},"300f151c-066b-4953-94b0-02c4b448aa1f":{"type":"faq","settings":{"title":"How do I subscribe?","content":"<p>If you have already logged in to your account, click on “My Account” under your name. Follow the steps to setup your subscription. You will have to create\/login to your PayTM wallet to enable auto-debit function. Subscribing to our service will ensure that you never have to worry about running out of shaving supplies.<\/p>"}},"25fbd1d0-ccc0-4688-a2bd-755aa68a65c9":{"type":"faq","settings":{"title":"What is Auto-debit?","content":"<p>Auto-debit pertains to the amount that is deducted from your PayTM wallet as your replenishment date approaches. This amount is calculated based on your subscription plan. For example, if you choose to replenish a Pre-Shave Scrub, Shaving Cream and Post-Shave Balm the total sum of their MRPs would be deducted from your PayTM wallet 5-6 days before delivery.<\/p>"}},"f6909dde-f453-438a-8894-58025a18cb1e":{"type":"faq","settings":{"title":"Why do I need to setup a Paytm wallet to subscribe?","content":"<p>We have tied up with Paytm to ensure we can seamlessly auto-debit your subscription amount and send you your refills. In case you do not have a Paytm wallet and are not inclined to set it up, just let us know. We'll figure out a way to get your shave supplies to you.<\/p>"}},"ce3c6439-4aba-44e0-823d-3933ddb2068f":{"type":"faq","settings":{"title":"Why am I getting charged Rs 1 on my PayTM Wallet when I subscribe after I have purchased the kit?","content":"<p>The Rs 1 transaction is to ensure that your PayTM Wallet is linked to our backend and the subscription is activated. We will refund the Rs. 1 to you in the form of referral credits in your account.<\/p>"}},"df20a0e8-5824-41e4-91fe-fb2b49de04cd":{"type":"faq","settings":{"title":"What if my wallet is debited when not desired?","content":"<p>Get in touch with us at the earliest and we will refund the payment.<\/p>"}},"0ea65bab-12a0-4102-aa45-e24457d763a0":{"type":"faq","settings":{"title":"Can I use a different wallet other than PayTM?","content":"<p>Unfortunately, we have currently only partnered with PayTM to provide a wallet-based solution for our subscription services.<\/p>"}},"59644529-75e6-43d2-ab79-e52828ea7e9d":{"type":"faq","settings":{"title":"How do I cancel my subscription?","content":"<p>First login to your account on our website. Next, go to the 'Settings' section in your account, navigate to the bottom of the page and click on 'Cancel my Subscription.'<\/p>"}},"193dcbbe-8b91-4e90-b7a8-67d5faec5b7c":{"type":"faq","settings":{"title":"How do I modify my subscription?","content":"<p>After you login to your account on our website, go to the 'My Account' section. You will be able to modify your subscription under the 'My Subscription' tab.<\/p>"}},"b0750fd0-083d-403c-850b-6130738334a1":{"type":"faq","settings":{"title":"Why can I only subscribe to shaving supplies?","content":"<p>As of now, subscription services are only available for your shaving supplies. However, stay tuned for a new and exciting subscription options by Bombay Shaving Company.<\/p>"}}},"block_order":["faqs-0","faqs-1","faqs-2","faqs-3","7e1b959c-296e-432b-8fd1-7b5ad6895a70","288d1082-3daf-46f9-bd3f-4ad2e323d6fb","1a3d4015-e3a6-47bb-b7b2-29eedb5df2b7","e577bb80-7def-4804-ab60-2a9d53ecf1a4","39fca6f8-546b-4452-83a9-84297981c949","d9f62ee5-effa-4ed4-925f-6ba7c1ba1eb9","30a12927-e3c0-4285-8b07-36b6c1e6d04c","300f151c-066b-4953-94b0-02c4b448aa1f","25fbd1d0-ccc0-4688-a2bd-755aa68a65c9","f6909dde-f453-438a-8894-58025a18cb1e","ce3c6439-4aba-44e0-823d-3933ddb2068f","df20a0e8-5824-41e4-91fe-fb2b49de04cd","0ea65bab-12a0-4102-aa45-e24457d763a0","59644529-75e6-43d2-ab79-e52828ea7e9d","193dcbbe-8b91-4e90-b7a8-67d5faec5b7c","b0750fd0-083d-403c-850b-6130738334a1"],"settings":{}}},"order":["main"]}